Revit 2026 API

# ElectricalSystemIsCircuitPathValid Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCircuitPathValid(
	IList<XYZ> nodes
)
```
```vb
Public Function IsCircuitPathValid (
	nodes As IList(Of XYZ)
) As Boolean
```
```cpp
public:
bool IsCircuitPathValid(
	IList<XYZ^>^ nodes
)
```
```fsharp
member IsCircuitPathValid :
        nodes : IList<XYZ> -> bool
```

#### Parameters

nodes IListXYZ

#### Return Value

Boolean

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace